In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.DataFrame(
{
    "name":["Amy","Bob","Chen"],
    "salary":[30000,40000,22000]
}, index=['a','b','c'])# (字典, index= 索引列表)

In [3]:
data['revenue'] = [50000,40000,30000]

In [4]:
data

   name  salary  revenue
a   Amy   30000    50000
b   Bob   40000    40000
c  Chen   22000    30000

In [5]:
data.size

9

In [6]:
data.shape

(3, 3)

In [7]:
data.index

Index(['a', 'b', 'c'], dtype='object')

In [8]:
data.columns

Index(['name', 'salary', 'revenue'], dtype='object')

In [9]:
# 取得第二列 , 按照列順序
data.iloc[1]

name         Bob
salary     40000
revenue    40000
Name: b, dtype: object

In [10]:
# 取得第二列 , 按照自訂的索引
data.loc["c"]

name        Chen
salary     22000
revenue    30000
Name: c, dtype: object

In [11]:
# 取得第二欄
data["name"]

a     Amy
b     Bob
c    Chen
Name: name, dtype: object

In [12]:
data['rank']=pd.Series([3,6,1],index=['a','b','c'])

In [13]:
data

   name  salary  revenue  rank
a   Amy   30000    50000     3
b   Bob   40000    40000     6
c  Chen   22000    30000     1

In [14]:
data["name"].str.upper()

a     AMY
b     BOB
c    CHEN
Name: name, dtype: object

In [15]:
data

   name  salary  revenue  rank
a   Amy   30000    50000     3
b   Bob   40000    40000     6
c  Chen   22000    30000     1

In [16]:
data["name"]=data["name"].str.upper()

In [17]:
data

   name  salary  revenue  rank
a   AMY   30000    50000     3
b   BOB   40000    40000     6
c  CHEN   22000    30000     1

In [18]:
data["salary_avg"]=data["salary"].mean()

In [19]:
data

   name  salary  revenue  rank    salary_avg
a   AMY   30000    50000     3  30666.666667
b   BOB   40000    40000     6  30666.666667
c  CHEN   22000    30000     1  30666.666667

In [20]:
data["salary"].mean() #利用broadcasting 把此數值全部寫入新欄位

30666.666666666668

In [21]:
# 創建新欄位,利用向量運算
data["cp"]=data['revenue']/data["salary"]

In [22]:
data

   name  salary  revenue  rank    salary_avg        cp
a   AMY   30000    50000     3  30666.666667  1.666667
b   BOB   40000    40000     6  30666.666667  1.000000
c  CHEN   22000    30000     1  30666.666667  1.363636

In [23]:
# 尋找某欄位中，是否有包含大寫H字元，若是則True ，若否則False， 回應結果為一個布林陣列
cond1 = data["name"].str.contains("H")

In [24]:
data[cond1]

   name  salary  revenue  rank    salary_avg        cp
c  CHEN   22000    30000     1  30666.666667  1.363636

In [25]:
cond2= data['salary']>=40000
data[cond2]

  name  salary  revenue  rank    salary_avg   cp
b  BOB   40000    40000     6  30666.666667  1.0

In [26]:
cond3=data['name']=="amy"

In [27]:
data[cond3].shape

(0, 6)

In [28]:
# 實務演練 :  https://bit.ly/2UMcbDI
# 收集資料
# 清理資料
# 分析資料
# 基於資料的應用

In [42]:
data1 = pd.read_csv('./0822googleplaystore.csv',encoding='latin-1')